import pandas as pd
import matplotlib.pyplot as plt
import datetime, os
import numpy as np
from scipy.optimize import curve_fit
from sklearn.linear_model import LinearRegression, LogisticRegression
import plotly.express as px
import plotly.graph_objects as go

def add_density_and_update_pop(df_in):
    table="""ירושלים 	ירושלים 	919,438 	901,302 	882,652 	125,420 	7,186 	יהודית, ערבית-מוסלמית, ערבית-נוצרית. 	2.1% 	3 	משה ליאון 	המאה ה-10 לפנה"ס[5] 	1863‏[6]
תל אביב-יפו 	תל אביב 	451,523 	443,939 	438,818 	51,830 	8,565 	יהודית, ערבית-מוסלמית, ערבית-נוצרית. 	1.2% 	8 	רון חולדאי 	1909‏[7] 	1934‏[8]
חיפה 	חיפה 	283,640 	281,087 	279,591 	64,680 	4,346 	יהודית, ערבית-מוסלמית, ערבית-נוצרית, דרוזית. 	0.5% 	7 	עינת קליש-רותם 	1761‏[9] 	1873
ראשון לציון 	מרכז 	251,719 	249,860 	247,323 	58,860 	4,245 	יהודית 	1.0% 	7 	רז קינסטליך 	1882 	1950
פתח תקווה 	מרכז 	244,275 	240,357 	236,169 	35,720 	6,729 	יהודית 	1.8% 	7 	רמי גרינברג 	1878 	1937
אשדוד 	דרום 	224,628 	222,883 	221,591 	46,130 	4,832 	יהודית 	0.6% 	5 	יחיאל לסרי 	1956‏[10] 	1968
נתניה 	מרכז 	217,243 	214,101 	210,834 	29,040 	7,373 	יהודית 	1.5% 	6 	מרים פיירברג 	1928 	1948
באר שבע 	דרום 	209,002 	207,551 	205,810 	117,320 	1,769 	יהודית 	0.8% 	5 	רוביק דנילוביץ' 	האלף ה-4 לפנה"ס בתל באר שבע 	1950[11]
בני ברק 	תל אביב 	198,863 	193,774 	188,964 	7,310 	26,508 	יהודית 	2.5% 	2 	אברהם רובינשטיין 	1924‏[12] 	1950
חולון 	תל אביב 	194,273 	192,624 	190,838 	19,060 	10,106 	יהודית 	0.9% 	6 	מוטי ששון 	1940[13] 	1950
רמת גן 	תל אביב 	159,160 	156,277 	153,674 	16,400 	9,529 	יהודית 	1.7% 	8 	כרמל שאמה הכהן 	1921 	1950
אשקלון 	דרום 	145,967 	137,332 	134,454 	45,960 	3,001 	יהודית 	2.6% 	5 	תומר גלאם 	1949 	1950[14]
רחובות 	מרכז 	141,579 	138,379 	135,726 	23,720 	5,834 	יהודית 	2.0% 	7 	רחמים מלול 	1890 	1950
בת ים 	תל אביב 	128,774 	128,655 	128,904 	8,160 	15,767 	יהודית 	0.2%- 	5 	צבי ברוט 	1926 	1958
בית שמש 	ירושלים 	118,676 	114,371 	109,762 	38,670 	2,958 	יהודית 	4.2% 	2 	עליזה בלוך 	1950 	1991
כפר סבא 	מרכז 	100,764 	100,039 	98,981 	14,500 	6,899 	יהודית 	1.1% 	8 	רפי סער 	1903 	1962
הרצליה 	תל אביב 	95,142 	93,989 	93,116 	21,770 	4,317 	יהודית 	0.9% 	8 	משה פדלון 	1924 	1960
חדרה 	חיפה 	95,683 	93,973 	91,707 	50,640 	1,856 	יהודית 	2.5% 	6 	צבי גנדלמן 	1891 	1952
מודיעין- מכבים- רעות 	מרכז 	92,406 	91,328 	90,013 	48,330 	1,890 	יהודית 	1.5% 	8 	חיים ביבס 	1996‏[15] 	2001‏[16]
נצרת 	צפון 	77,063 	76,551 	75,922 	14,140 	5,414 	ערבית-מוסלמית, ערבית-נוצרית 	0.8% 	3 	עלי סלאם 	תקופת בית שני 	1875
לוד 	מרכז 	75,726 	74,604 	73,608 	12,090 	6,171 	יהודית, ערבית-מוסלמית, מעט ערבית-נוצרית 	1.4% 	4 	יאיר רביבו 	האלף ה-6 לפנה"ס 	1877
רמלה 	מרכז 	75,538 	75,668 	74,964 	12,050 	6,280 	יהודית, ערבית-מוסלמית, ערבית-נוצרית 	0.2%- 	4 	מיכאל וידל 	המאה ה-8 	1877
רעננה 	מרכז 	73,999 	72,810 	71,686 	14,820 	4,913 	יהודית 	1.6% 	8 	חיים ברוידא 	1922 	1982
מודיעין עילית 	יהודה ושומרון 	73,080 	70,081 	66,847 	4,830 	14,510 	יהודית 	4.8% 	1 	יעקב גוטרמן 	1990 	2008
רהט 	דרום 	69,033 	66,791 	64,462 	19,630 	3,402 	ערבית-בדווית 	3.6% 	1 	פאיז אבו צהבאן 	1972 	1994
הוד השרון 	מרכז 	62,325 	61,102 	58,914 	19,400 	3,150 	יהודית 	3.7% 	8 	אמיר כוכבי 	1964[17] 	1990
גבעתיים 	תל אביב 	60,212 	59,518 	58,508 	3,250 	18,313 	יהודית 	1.7% 	8 	רן קוניק 	1922 	1959
קריית אתא 	חיפה 	58,268 	57,518 	56,635 	16,320 	3,524 	יהודית 	1.6% 	6 	יעקב פרץ 	1925 	1969
נהריה 	צפון 	56,880 	56,071 	54,903 	11,140 	5,033 	יהודית 	2.1% 	6 	רונן מרלי 	1935 	1961
ביתר עילית 	יהודה ושומרון 	56,746 	54,557 	51,636 	4,920 	11,089 	יהודית 	5.7% 	1 	מאיר רובינשטיין 	1988 	2001
אום אל-פחם 	חיפה 	55,183 	54,240 	53,306 	26,060 	2,081 	ערבית-מוסלמית 	1.8% 	2 	סמיר מחאמיד 	1265‏[18] 	1984
קריית גת 	דרום 	54,972 	53,487 	52,585 	15,910 	3,362 	יהודית 	1.7% 	4 	אבירם דהרי 	1954 	1972
אילת 	דרום 	51,935 	50,724 	50,072 	98,760 	514 	יהודית 	1.3% 	6 	מאיר יצחק-הלוי 	1951 	1959
ראש העין 	מרכז 	56,344 	50,453 	45,487 	15,840 	3,185 	יהודית 	10.9% 	7 	שלום בן-משה 	1949 	1994
עפולה 	צפון 	51,737 	49,169 	47,014 	29,310 	1,678 	יהודית 	4.6% 	5 	אבי אלקבץ 	1925 	1972
נס ציונה 	מרכז 	50,213 	49,108 	48,161 	15,730 	3,122 	יהודית 	2.0% 	8 	שמואל בוקסר 	1883 	1992
עכו 	צפון 	48,929 	48,303 	47,808 	14,260 	3,387 	יהודית, ערבית-מוסלמית, ערבית-נוצרית. 	1.0% 	4 	שמעון לנקרי 	מאה 15 לפנה"ס 	1877
אלעד 	מרכז 	47,865 	46,896 	45,854 	3,470 	13,515 	יהודית 	2.3% 	2 	ישראל פרוש 	1998 	2008
רמת השרון 	תל אביב 	46,721 	46,019 	45,066 	16,620 	2,769 	יהודית 	2.1% 	9 	אבירם גרובר 	1923 	2002
כרמיאל 	צפון 	46,124 	45,919 	45,300 	21,930 	2,094 	יהודית 	1.6% 	6 	משה קונינסקי 	1964 	1986
יבנה 	מרכז 	46,705 	45,483 	44,050 	16,310 	2,789 	יהודית 	3.3% 	6 	צבי גוב-ארי 	1949 	1986
טבריה 	צפון 	44,233 	43,664 	43,148 	16,280 	2,682 	יהודית 	1.2% 	4 	שמעון מעתוק (יו"ר ועדה קרואה) 	20 	1877
טייבה 	מרכז 	43,128 	42,401 	41,577 	18,870 	2,247 	ערבית-מוסלמית 	2% 	3 	שועאע מסארווה מנצור 	המאה ה-17‏[19] 	1990
קריית מוצקין 	חיפה 	42,014 	41,440 	40,750 	3,840 	10,792 	יהודית 	1.7% 	7 	חיים צורי 	1934 	1976
שפרעם 	צפון 	41,559 	41,024 	40,535 	19,580 	2,095 	ערבית-מוסלמית, ערבית-נוצרית, דרוזים 	1.2% 	3 	עורסאן יאסין 	תקופת התנאים 	1910
נוף הגליל 	צפון 	41,169 	40,596 	40,244 	33,020 	1,229 	יהודית, ערבית-מוסלמית, ערבית-נוצרית 	0.9% 	5 	רונן פלוט 	1957 	1974
קריית ים 	חיפה 	39,908 	39,710 	39,416 	4,580 	8,670 	יהודית 	0.7% 	5 	דוד אבן צור 	1941 	1976
קריית ביאליק 	חיפה 	39,927 	39,582 	39,294 	8,470 	4,673 	יהודית 	0.7% 	7 	אלי דוקורסקי 	1934 	1976
קריית אונו 	תל אביב 	39,985 	39,398 	38,596 	4,540 	8,678 	יהודית 	2.1% 	8 	ישראל גל 	1939 	1992
מעלה אדומים 	יהודה ושומרון 	38,193 	37,817 	37,670 	46,480 	814 	יהודית 	0.4% 	6 	בני כשריאל 	1977 	1991
אור יהודה 	תל אביב 	36,864 	36,706 	36,536 	6,700 	5,479 	יהודית 	0.5% 	5 	ליאת שוחט 	1949 	1988
צפת 	צפון 	35,716 	35,276 	33,636 	29,980 	1,177 	יהודית 	4.9% 	2 	שוקי אוחנה 	ימי בית שני 	1877
נתיבות 	דרום 	35,631 	33,779 	32,513 	10,150 	3,328 	יהודית 	3.9% 	3 	יחיאל זוהר 	1956 	2000
דימונה 	דרום 	34,135 	33,666 	33,452 	173,010 	195 	יהודית 	0.6% 	4 	בני ביטון 	1955 	1969
טמרה 	צפון 	33,851 	33,380 	32,804 	29,320 	1,138 	ערבית-מוסלמית 	1.8% 	2 	סוהיל דיאב 	תקופת האמוראים‏[20] 	1996
סח'נין 	צפון 	31,056 	30,548 	29,856 	9,820 	3,111 	ערבית-מוסלמית, ערבית-נוצרית 	2.3% 	3 	ספות אבו ריא 	התקופה הכנענית, 	1995
יהוד-מונוסון 	מרכז 	29,929 	29,689 	29,312 	5,000 	5,938 	יהודית 	1.3% 	8 	יעלה מקליס 	1948 	1995‏[21]
באקה אל-גרבייה 	חיפה 	29,394 	29,035 	28,526 	9,060 	3,205 	ערבית-מוסלמית 	1.8% 	3 	מורסי אבו מוך 	לא ידוע 	1996
אופקים 	דרום 	29,021 	27,771 	25,625 	10,240 	2,712 	יהודית 	4.3% 	3 	יצחק דנינו 	1955 	1995
גבעת שמואל 	מרכז 	26,023 	25,776 	25,544 	2,550 	10,108 	יהודית 	0.9% 	8 	יוסי ברודני 	1944 	2007
טירה 	מרכז 	26,163 	25,721 	25,268 	11,790 	2,182 	ערבית-מוסלמית 	1.8% 	4 	מאמון עבד אלחי 	לא ידוע 	1991
ערד 	דרום 	26,451 	25,530 	24,713 	102,610 	249 	יהודית 	3.3% 	4 	ניסן בן חמו 	1962 	1995
מגדל העמק 	צפון 	25,636 	25,371 	25,084 	8,750 	2,900 	יהודית 	1.1% 	4 	אלי ברדה 	1953 	1988
שדרות 	דרום 	26,455 	25,138 	24,016 	6,300 	3,990 	יהודית 	4.7% 	4 	אלון דוידי 	1953 	1996
עראבה 	צפון 	25,369 	24,972 	24,450 	8,250 	3,027 	ערבית-מוסלמית 	2.1% 	2 	ואכד עומר 	העת העתיקה 	2016
נשר 	חיפה 	23,982 	23,749 	23,684 	13,020 	1,824 	יהודית 	0.3% 	7 	רועי לוי 	1921 	1995
קריית שמונה 	צפון 	22,624 	22,844 	22,948 	14,560 	1,569 	יהודית 	0.5%- 	5 	אביחי שטרן 	1950 	1974
יקנעם עילית 	צפון 	23,311 	22,746 	22,014 	8,210 	2,771 	יהודית 	3.3% 	7 	סימון אלפסי 	1950 	2006
כפר קאסם 	מרכז 	23,206 	22,743 	22,265 	9,370 	2,427 	ערבית-מוסלמית 	2.1% 	3 	עאדל בדיר 	המאה ה-17 	2008
כפר יונה 	מרכז 	23,061 	22,537 	22,254 	11,340 	1,987 	יהודית 	1.6% 	7 	שושי כחלון-כידור 	1932 	2014
קלנסווה 	מרכז 	22,788 	22,370 	21,893 	8,400 	2,663 	ערבית-מוסלמית 	2.2% 	2 	עבד אל באסט סלאמה 	לא ידוע 	2000
קריית מלאכי 	דרום 	23,124 	22,337 	22,948 	4,540 	4,540 	יהודית 	2.4% 	3 	אליהו זוהר 	1950 	1998
מעלות- תרשיחא 	צפון 	21,423 	21,267 	21,142 	9,220 	2,307 	יהודית, ערבית-מוסלמית, ערבית נוצרית, דרוזית 	0.6% 	5 	ארקדי פומרנץ 	1957‏[22] 	1995
טירת כרמל 	חיפה 	22,209 	21,256 	20,313 	5,920 	3,591 	יהודית 	4.6% 	4 	אריה טל 	1949 	1992
אריאל 	יהודה ושומרון 	20,455 	19,626 	19,220 	14,360 	1,367 	יהודית 	2.1% 	6 	אליהו שבירו 	1978 	1998
אור עקיבא 	חיפה 	18,237 	17,759 	17,568 	5,540 	3,206 	יהודית 	1.1% 	5 	יעקב אדרי 	1951 	2001
בית שאן 	צפון 	18,226 	17,704 	17,587 	7,440 	2,380 	יהודית 	0.7% 	4 	ז'קי לוי 	1949 	1999 """

    table = np.array([x.strip() for x in '\t'.join(table.split('\n')).split('\t')])
    # src: https://he.wikipedia.org/wiki/%D7%A2%D7%A8%D7%99%D7%9D_%D7%91%D7%99%D7%A9%D7%A8%D7%90%D7%9C
    table = table.reshape(-1,13)
    cols = ['city','county','pop_2018','pop_2017','pop_2016','area','density','demo','other1','other2','mayor','est_year','city_since_year']
    df = pd.DataFrame(table)
    df.columns = cols
    sel = ['pop_2018','density']
    df = df[['city']+sel]
    for k in sel:
        df[k] = df[k].apply(lambda x: int(x.replace(',','')))
    print(df_in)
    df_in.loc[df_in['city']=='All','pop'] = 8972000 # israel 2018 population
    df_in['density']=0
    df_in.loc[df_in['city']=='All','density']= 393.05 # wikipedia: https://he.wikipedia.org/wiki/%D7%93%D7%9E%D7%95%D7%92%D7%A8%D7%A4%D7%99%D7%94_%D7%A9%D7%9C_%D7%99%D7%A9%D7%A8%D7%90%D7%9C
    for k,row in df_in.iterrows():
        if row['city'] == 'All': # handle some changes in naming
            continue
        if row['city'] == 'תל אביב':
            q = 'תל אביב-יפו'
        elif row['city'] == 'מודיעין-מכבים-רעות':
            q = 'מודיעין- מכבים- רעות'
        else:
            q = row['city']
        latest = df.query('city == "{}"'.format(q))
        term = df_in['city']==row['city']
        df_in.loc[term,'pop'] = int(latest['pop_2018'])
        df_in.loc[term,'density'] = int(latest['density'])
    return df_in
def get_population():
    # src: wikipedia, march 29 2020: https://he.wikipedia.org/wiki/%D7%AA%D7%91%D7%A0%D7%99%D7%AA:%D7%94%D7%A2%D7%A8%D7%99%D7%9D_%D7%94%D7%92%D7%93%D7%95%D7%9C%D7%95%D7%AA_%D7%A9%D7%9C_%D7%99%D7%A9%D7%A8%D7%90%D7%9C
    cities="""1 	ירושלים 	ירושלים 	865,700 	11 	רמת גן 	תל אביב 	152,600
    2 	תל אביב 	תל אביב 	432,900 	12 	רחובות 	המרכז 	132,700
    3 	חיפה 	חיפה 	278,900 	13 	אשקלון 	הדרום 	130,700
    4 	ראשון לציון 	המרכז 	247,323 	14 	בת ים 	תל אביב 	128,900
    5 	פתח תקווה 	המרכז 	231,000 	15 	בית שמש 	ירושלים 	103,900
    6 	אשדוד 	הדרום 	220,200 	16 	כפר סבא 	המרכז 	96,900
    7 	נתניה 	המרכז 	207,900 	17 	הרצליה 	תל אביב 	91,900
    8 	באר שבע 	הדרום 	203,600 	18 	חדרה 	חיפה 	88,800
    9 	חולון 	תל אביב 	188,800 	19 	מודיעין-מכבים-רעות 	המרכז 	88,700
    10 	בני ברק 	תל אביב 	182,800 	20 	נצרת 	הצפון 	75,700 """
    cities = np.array([x.strip() for x in '\t'.join(cities.split('\n')).split('\t')])
    cities = cities.reshape(-1,4)
    cities = cities[:,[1,3]]
    df = pd.DataFrame(cities)
    df.columns=['city','pop']
    df['pop'] = df['pop'].apply(lambda x: int(x.replace(',','')))
    return df

def input_cases_per_city(cache = 'inputted_from_walla_3349123.csv'):
    if os.path.exists(cache):
        df = pd.read_csv(cache)
    else:
        df = get_population()
        confirmed = []
        general = pd.DataFrame([['All',8546000]]) # population as of 2016, mattching the wikipedia city population year.
        general.columns=['city','pop']
        df = df.append(general)
        # filled via https://news.walla.co.il/item/3349123
        for i,(k,row) in enumerate(df.iterrows()):
            print('{}/{} enter number of confirmed for city/region {}'.format(i,len(df),row['city']))
            conf = input()
            conf = 0 if conf == '' else conf
            confirmed.append(int(conf))
        df['confirmed'] = confirmed
        print(df)
        df.to_csv(cache,index=None)
    return df

def plot_pie_chart_px(df,by='pop'):
    tot_pop = df.query('city == "All"')['pop']
    df = df.query('city != "All"')
    radius = df['ratio']
    # theta goes from 0 to 360-1
    width = np.array(df['pop'] / float(tot_pop) * 360)
    theta = np.cumsum(np.concatenate((width,[0])))[:-1] - width/2
    labels = np.array(df['city'])
    labels = ['{}<br>{:.3f}%'.format(x,y) for x,y in zip(labels,radius)]
    fig = go.Figure(go.Barpolar(
        r=radius,
        theta=theta,
        width=width,
        marker_color=3*["#E4FF87", '#709BFF', '#709BFF', '#FFAA70', '#FFAA70', '#FFDF70', '#B6FFB4'],
        marker_line_color="black",
        marker_line_width=1,
        opacity=0.8
        ))
    """layout=go.Layout(annotations=[
        go.layout.Annotation(
            text='Some<br>multi-line<br>text',
            align='left',
            showarrow=False,
            xref='paper',
            yref='paper',
            x=1.1,
            y=0.8,
            bordercolor='black',
            borderwidth=1
        )
    ]))"""
    r = np.linspace(0,1,10)
    fig.update_layout(
        title="Confirmed cases (% per city), March 27th",
        template=None,
        polar_angularaxis = dict(tickvals=theta,
                             ticktext=labels),
        polar_radialaxis = dict(tickvals=r,
                             ticktext=['{:1.2f}%'.format(x) for x in r])
    )
    fig.show()
def plot_density_scatter(df):
    fig = px.scatter(df, x="density", y="ratio", text="city", log_x=False, trendline='ols')#, size_max=60)

    fig.update_traces(textposition='top center')

    fig.update_layout(
        height=700,width=900,
        xaxis_title='Density (people / km²)',
        yaxis_title='Confirmed cases (%)',
        title_text='Confirmed cases (March 27th) v. density',
    )

    fig.show()
if __name__ == '__main__':
    df = input_cases_per_city()
    df = add_density_and_update_pop(df)
    print(df.to_string())

    df = df.query('confirmed > 0')
    df['ratio'] = np.round(100* 1.*df['confirmed'] / df['pop'],3)
    df['city_rev'] = df['city'].apply(lambda x: x[::-1] if x != 'All' else x)
    plot_pie_chart_px(df)

    plot_density_scatter(df)
    # plot confirmed vs density
    # ax = df.plot.bar(x='city_rev',y='ratio',rot=45)
    #ax.set_ylabel('%')
    #plt.show()

